import React from 'react';

const Background = () => {
  return (
    <div
      className="Frame3338"
      style={{
        position: 'absolute', // Абсолютное позиционирование
        top: 0, 
        left: 0, 
        width: '100vw', // Растягиваем на всю ширину экрана
        height: '100vh', // Растягиваем на всю высоту экрана
        zIndex: 0, 
        overflow: 'hidden', 
      }}
    >
      <svg
        width="100%" // Растягиваем SVG на всю ширину контейнера
        height="100%" // Растягиваем SVG на всю высоту контейнера
        viewBox="0 0 1440 896" // Сохраняем пропорции SVG
        fill="none"
        xmlns="http://www.w3.org/2000/svg"
      >
        <g opacity="0.3" filter="url(#filter0_f_9_241)">
          <path
            fillRule="evenodd"
            clipRule="evenodd"
            d="M109.917 1061.52C27.0238 994.636 -117.569 935.463 -62.4269 819.3C-7.31579 703.202 189.065 689.011 320.957 616.943C443.891 549.768 544.525 432.912 672.778 417.566C823.298 399.557 1001.04 420.186 1026.08 532.573C1050.92 644.028 851.098 758.836 776.496 882.956C717.141 981.706 754.722 1108.77 641.583 1172.28C528.33 1235.87 431.891 1156.16 328.307 1134.58C246.789 1117.6 166.246 1106.97 109.917 1061.52Z"
            fill="#2563EB"
          />
          <path
            fillRule="evenodd"
            clipRule="evenodd"
            d="M560.558 340.198C541.178 547.686 879.662 578.303 1006.33 743.754C1099.69 865.698 1029.77 1125.94 1181.28 1150.98C1337.38 1176.77 1394.18 941.735 1501.67 825.613C1559.96 762.639 1635.15 716.951 1659.26 634.594C1683.91 550.365 1667.54 462.792 1631.27 382.879C1590.19 292.35 1532.96 211.734 1445.72 164.081C1327.96 99.7574 1200.34 49.4252 1068.73 75.6105C874.026 114.351 579.022 142.509 560.558 340.198Z"
            fill="#10B981"
          />
          <path
            fillRule="evenodd"
            clipRule="evenodd"
            d="M78.6219 608.166C-49.7507 607.879 -239.83 657.413 -284.987 537.245C-332.48 410.862 -124.866 335.63 -70.1802 212.19C-32.2042 126.468 -105.973 -10.6474 -22.9574 -54.2229C60.7648 -98.1694 133.875 37.2071 226.443 56.4894C331.925 78.4616 454.959 -6.98223 537.321 62.4847C630.699 141.242 685.968 290.106 635.11 401.171C585.422 509.681 431.164 496.988 319.306 538.595C237.936 568.862 165.438 608.36 78.6219 608.166Z"
            fill="#F59E0B"
          />
        </g>
        <defs>
          <filter
            id="filter0_f_9_241"
            x="-391.991"
            y="-162.948"
            width="2163.01"
            height="2715.59"
            filterUnits="userSpaceOnUse"
            colorInterpolationFilters="sRGB"
          >
            <feFlood floodOpacity="0" result="BackgroundImageFix" />
            <feBlend mode="normal" in="SourceGraphic" in2="BackgroundImageFix" result="shape" />
            <feGaussianBlur stdDeviation="50" result="effect1_foregroundBlur_9_241" />
          </filter>
        </defs>
      </svg>
    </div>
  );
};

export default Background;